package com.kh.parttimeMVCProject.view;

public class MenuViewer {
	
//	public static void main(String[] args) {
//	}
	
//	// 메인메뉴
//	public static void mainMenuView() {
//		System.out.println();
//		System.out.println("======================================알바비 계산 프로그램======================================");
//		System.out.println("1.부서 정보메뉴  2.알바생 정보메뉴  3.근무시간 정보메뉴  4.알바비지급내역 정보메뉴  5.전체정보 출력하기  6.프로그램 종료");
//		System.out.print("번호를 선택해주세요 (1~6) >> ");
//	}
	
	// 메인메뉴
	public static void mainMenuView() {
		System.out.println();
		System.out.println("=========================================알바비 계산 프로그램=========================================");
		System.out.println("1.부서 정보메뉴  2.알바생 정보메뉴  3.근무시간 정보메뉴  4.전체정보 출력하기  5.알바생별시급 출력하기  6.프로그램 종료");
		System.out.println("==================================================================================================");
		System.out.print("번호를 선택해주세요 (1~5) >> ");
	}
	
	// 부서 메뉴
	public static void departmentMenuView() {
		System.out.println();
		System.out.println("--------------------------------------------부서 정보 메뉴--------------------------------------------");
		System.out.println("1.부서정보 보여주기  2.부서정보 추가하기  3.부서정보 수정하기  4.부서정보 삭제하기  5.부서번호순 나열  6.메인메뉴로 나가기");
		System.out.println("---------------------------------------------------------------------------------------------------");
		System.out.print("번호를 선택해주세요 (1~6) >> ");
	}
	
	// 알바생 메뉴
	public static void employeeMenuView() {
		System.out.println();
		System.out.println("-----------------------------------------------알바생 정보 메뉴-----------------------------------------------");
		System.out.println("1.알바생정보 보여주기  2.알바생정보 추가하기  3.알바생정보 수정하기  4.알바생정보 삭제하기  5.알바생 시급순나열  6.메인메뉴로 나가기");
		System.out.println("----------------------------------------------------------------------------------------------------------");
		System.out.print("번호를 선택해주세요 (1~6) >> ");
	}
	
	// 근무 메뉴
	public static void workhourMenuView() {
		System.out.println();
		System.out.println("-------------------------------------------근무 정보 메뉴-------------------------------------------");
		System.out.println("1.근무정보 보여주기  2.근무정보 추가하기  3.근무정보 수정하기  4.근무정보 삭제하기  5.임금순 나열  6.메인메뉴로 나가기");
		System.out.println("------------------------------------------------------------------------------------------------");
		System.out.print("번호를 선택해주세요 (1~6) >> ");
	}
	
//	// 지급 내역 메뉴
//	public static void historyMenuView() {
//		System.out.println();
//		System.out.println("---------------------------------------지급내역 정보 메뉴---------------------------------------");
//		System.out.println("1.지급내역정보 보여주기  2.지급내역정보 추가하기  3.지급내역정보 수정하기  4.지급내역정보 삭제하기  5.메인메뉴로 나가기");
//		System.out.print("번호를 선택해주세요 (1~5) >> ");
//	}

}
